In [ ]:
import pandas as pd
import numpy as np
import math

In [ ]:
df = pd.read_csv ('class_grades.csv')
df

       name  id  prelim_grades  midterm_grades  final_grades
0     alpha   1      94.960000          95.260       92.2192
1     aleph   2      94.960000          95.260       92.7792
2      beta   3      78.173333          94.360       84.3200
3      beth   4      78.173333          81.372       84.6400
4    cuprum   5      94.960000          95.260       92.2192
5     delta   6      84.826667          92.485       83.5792
6       eta   7      93.980000          97.300       95.6528
7   epsilon   8      60.788200          68.000       83.8672
8   foxtrot   9      94.306667          82.000       84.1472
9     gamma  10      96.406667          82.000       84.1472
10     geld  11      86.926667          92.485       82.7792
11    horus  12      78.173333          94.360       84.3200
12     iota  13      94.306667          82.000       84.1472
13     ixus  14      78.173333          94.360       84.3200
14  jakarta  15      84.826667          92.485       82.7792
15    koppa  16            NaN          87.685       83.8672
16   lambda  17      93.980000          97.300       95.6528
17       mu  18      79.806667          83.500       81.2792
18       nu  19      75.406667          82.000       82.5472
19     neta  20      69.314000          87.685       50.3360
20  omicron  21      93.980000          97.300       95.6528
21    omega  22      79.806667          83.500       81.2792
22  phalanx  23      84.826667          92.485       82.7792
23     peta  24      94.960000          95.260       92.2192
24       pi  25      79.806667          87.460       81.2792
25    yotta  26      93.980000          97.300       94.8528
26     zeta  27      86.626667          84.850       83.8672

Task 1

In [ ]:
name = [df.name] #Names of Students
id = [df.id] #ID of Students
pgrades = [df.prelim_grades] #Prelim Grades
mgrades = [df.midterm_grades] #Midterm Grades
fgrades = [df.final_grades] #Final Grades

In [ ]:
df['prelim_grades'] = df['prelim_grades'].fillna(0)

Task 2

In [ ]:
def mean(grades):
  pgrades_sum = 0
  for grade in grades:
    pgrades_sum += grade
  m = pgrades_sum/len(grades)
  return m

print(mean(df.prelim_grades))
print(mean(df.midterm_grades))
print(mean(df.final_grades))

82.46057531851854
89.456
85.2418074074074

In [ ]:
def median(grades):
  grades_sum = 0
  for grade in grades:
    grades_sum += grade
    m = sorted(grades)[len(grades)//2]
    return m

print(median(df.prelim_grades))
print(median(df.midterm_grades))
print(median(df.final_grades))

84.8266667
92.485
84.1472

In [ ]:
def mode(grades):
	frequency = {}
	for grade in grades:
		frequency.setdefault(grade,0)
		frequency[grade]+=1
	highestFrequency=max(frequency.values())
	highestFreqLst=[]
	for grade, freq in frequency.items():
		if freq == highestFrequency:
			highestFreqLst.append(grade)
	return highestFreqLst

print(mode(df.prelim_grades))
print(mode(df.midterm_grades))
print(mode(df.final_grades))

[94.96, 78.1733333, 93.98]
[95.26, 92.485, 97.3, 82.0]
[92.2192, 84.32, 95.6528, 83.8672, 84.1472, 82.7792, 81.2792]

In [ ]:
def semestral(grades):
  sem_gr = 0
  for grade in grades:
    sem_gr += grade
  sgrade = 0.3*df.prelim_grades + 0.3*df.midterm_grades + 0.4*df.final_grades
  return sgrade

print(semestral(df.final_grades))

0     93.95368
1     94.17768
2     85.48800
3     81.71960
4     93.95368
5     86.62518
6     95.64512
7     72.18334
8     86.55088
9     87.18088
10    86.93518
11    85.48800
12    86.55088
13    85.48800
14    86.30518
15    59.85238
16    95.64512
17    81.50368
18    80.24088
19    67.23410
20    95.64512
21    81.50368
22    86.30518
23    93.95368
24    82.69168
25    95.32512
26    84.98988
dtype: float64

In [ ]:
def semestral(grades):
  sem_gr = 0
  for grade in grades:
    sem_gr += grade
  sgrade = 0.3*df.prelim_grades + 0.3*df.midterm_grades + 0.4*df.final_grades
  return sgrade

print('Highest Prelim Grade is:',max(df.prelim_grades))
print('Lowest Prelim Grade is:',min(df.prelim_grades))

Highest Prelim Grade is: 96.4066667
Lowest Prelim Grade is: 0.0

In [ ]:
def semestral(grades):
  sem_gr = 0
  for grade in grades:
    sem_gr += grade
  sgrade = 0.3*df.prelim_grades + 0.3*df.midterm_grades + 0.4*df.final_grades
  return sgrade

print(semestral(df.final_grades))
print('Highest Semestral Grade is:', max(semestral(df.final_grades))) 
print('Lowest Semestral Grade is:', min(semestral(df.final_grades)))

0     93.95368
1     94.17768
2     85.48800
3     81.71960
4     93.95368
5     86.62518
6     95.64512
7     72.18334
8     86.55088
9     87.18088
10    86.93518
11    85.48800
12    86.55088
13    85.48800
14    86.30518
15    59.85238
16    95.64512
17    81.50368
18    80.24088
19    67.23410
20    95.64512
21    81.50368
22    86.30518
23    93.95368
24    82.69168
25    95.32512
26    84.98988
dtype: float64
Highest Semestral Grade is: 95.64511999999999
Lowest Semestral Grade is: 59.85238

In [ ]:
def semestral(grades):
  sem_gr = 0
  for grade in grades:
    sem_gr += grade
  sgrade = 0.3*df.prelim_grades + 0.3*df.midterm_grades + 0.4*df.final_grades
  return sgrade

print('Highest Midterm Grade is:',max(df.midterm_grades))
print('Lowest Midterm Grade is:',min(df.midterm_grades))

Highest Midterm Grade is: 97.3
Lowest Midterm Grade is: 68.0

In [ ]:
def semestral(grades):
  sem_gr = 0
  for grade in grades:
    sem_gr += grade
  sgrade = 0.3*df.prelim_grades + 0.3*df.midterm_grades + 0.4*df.final_grades
  return sgrade

print('Highest Final Grade is:',max(df.final_grades))
print('Lowest Final Grade is:',min(df.final_grades))

Highest Final Grade is: 95.6528
Lowest Final Grade is: 50.336000000000006

In [ ]:
def semestral(grades):
  sem_gr = 0
  for grade in grades:
    sem_gr += grade
  sgrade = 0.3*df.prelim_grades + 0.3*df.midterm_grades + 0.4*df.final_grades
  return sgrade

print('Highest Prelim Grades:', max(df.prelim_grades))
print('Lowest Prelim Grades:', min(df.prelim_grades))
print('---------------------------------------------')
print('Highest Midterm Grade:', max(df.midterm_grades))
print('Lowest Midterm Grade:', min(df.midterm_grades))
print('---------------------------------------------')
print('Highest Final Grade:', min(df.final_grades))
print('Lowest Final Grade:', max(df.final_grades))
print('---------------------------------------------')
print('Highest Semestral Grade is:', max(semestral(df.final_grades))) 
print('Lowest Semestral Grade is:', min(semestral(df.final_grades)))

Highest Prelim Grades: 96.4066667
Lowest Prelim Grades: 0.0
---------------------------------------------
Highest Midterm Grade: 97.3
Lowest Midterm Grade: 68.0
---------------------------------------------
Highest Final Grade: 50.336000000000006
Lowest Final Grade: 95.6528
---------------------------------------------
Highest Semestral Grade is: 95.64511999999999
Lowest Semestral Grade is: 59.85238

In [ ]:
def stdv(grades):
  grades_sum = 0
  for grade in grades:
    mm =  sum((grades-np.mean(grades))**2)/len(grades)
    grades.std
    return mm

print(stdv(df.prelim_grades))
print(stdv(df.midterm_grades))
print(stdv(df.final_grades))

343.39487421412787
49.637213407407415
71.34507115105623

In [ ]:
def stanDev(grades):
	length = len(grades)
	m = mean(grades)
	total_sum = 0
	for i in range(length):
		total_sum += (grades[i]-m)**2
	under_root = total_sum*1.0/length
	return math.sqrt(total_sum/length)
print(stanDev(df.prelim_grades))
print(stanDev(df.midterm_grades))
print(stanDev(df.final_grades))

18.53091671272978
7.04536822369189
8.446601159700641

In [ ]:
print(semestral(df.final_grades))

0     93.95368
1     94.17768
2     85.48800
3     81.71960
4     93.95368
5     86.62518
6     95.64512
7     72.18334
8     86.55088
9     87.18088
10    86.93518
11    85.48800
12    86.55088
13    85.48800
14    86.30518
15    59.85238
16    95.64512
17    81.50368
18    80.24088
19    67.23410
20    95.64512
21    81.50368
22    86.30518
23    93.95368
24    82.69168
25    95.32512
26    84.98988
dtype: float64

In [ ]:
df['semestral_grades'] = (semestral(df.final_grades))
df

       name  id  prelim_grades  midterm_grades  final_grades  semestral_grades
0     alpha   1      94.960000          95.260       92.2192          93.95368
1     aleph   2      94.960000          95.260       92.7792          94.17768
2      beta   3      78.173333          94.360       84.3200          85.48800
3      beth   4      78.173333          81.372       84.6400          81.71960
4    cuprum   5      94.960000          95.260       92.2192          93.95368
5     delta   6      84.826667          92.485       83.5792          86.62518
6       eta   7      93.980000          97.300       95.6528          95.64512
7   epsilon   8      60.788200          68.000       83.8672          72.18334
8   foxtrot   9      94.306667          82.000       84.1472          86.55088
9     gamma  10      96.406667          82.000       84.1472          87.18088
10     geld  11      86.926667          92.485       82.7792          86.93518
11    horus  12      78.173333          94.360       84.3200          85.48800
12     iota  13      94.306667          82.000       84.1472          86.55088
13     ixus  14      78.173333          94.360       84.3200          85.48800
14  jakarta  15      84.826667          92.485       82.7792          86.30518
15    koppa  16       0.000000          87.685       83.8672          59.85238
16   lambda  17      93.980000          97.300       95.6528          95.64512
17       mu  18      79.806667          83.500       81.2792          81.50368
18       nu  19      75.406667          82.000       82.5472          80.24088
19     neta  20      69.314000          87.685       50.3360          67.23410
20  omicron  21      93.980000          97.300       95.6528          95.64512
21    omega  22      79.806667          83.500       81.2792          81.50368
22  phalanx  23      84.826667          92.485       82.7792          86.30518
23     peta  24      94.960000          95.260       92.2192          93.95368
24       pi  25      79.806667          87.460       81.2792          82.69168
25    yotta  26      93.980000          97.300       94.8528          95.32512
26     zeta  27      86.626667          84.850       83.8672          84.98988

Task 3

In [ ]:
df1 = pd.read_excel ('classlists.xlsx','class1')
df1

     Student Numbers
0          201009754
1          201109795
2          201005713
3          201009855
4          201006171
..               ...
995        201108927
996        201005697
997        201005744
998        201109959
999        201109382

[1000 rows x 1 columns]

In [ ]:
df2 = pd.read_excel ('classlists.xlsx','class2')
df2

     Student Numbers
0          201103056
1          201105136
2          201002284
3          201104588
4          201004799
..               ...
995        201101346
996        201007625
997        201003815
998        201102428
999        201006876

[1000 rows x 1 columns]

In [ ]:
class1 = df1["Student Numbers"]
class2 = df2["Student Numbers"]


class1_as_set = set(class1)
intersection = class1_as_set.intersection(class2)

intersection_as_list = list(intersection)

print(intersection_as_list)
cstudentnumber1 = df1
cstudentnumber2 = df2

get_student_number = set(cstudentnumber1)
intersection = get_student_number.intersection(cstudentnumber2)

lists_student_num = list(intersection)
print(lists_student_num)

[201009157, 201002245, 201009671, 201008775, 201102471, 201108238, 201105295, 201108241, 201105430, 201106199, 201003675, 201009820, 201103263, 201102367, 201004454, 201002279, 201009959, 201105318, 201109930, 201003688, 201101996, 201005482, 201102510, 201009967, 201103024, 201109680, 201008815, 201109299, 201106739, 201007925, 201005367, 201105592, 201008697, 201002173, 201102397, 201104063, 201109056, 201004865, 201109823, 201007043, 201105857, 201101893, 201009096, 201009997, 201108816, 201104594, 201003730, 201006042, 201005275, 201106780, 201005150, 201002849, 201007074, 201005415, 201108071, 201105896, 201105259, 201102318, 201102320, 201105014, 201005821, 201005822]
['Student Numbers']

In [ ]:
class1 = df1["Student Numbers"]
class2 = df2["Student Numbers"]
list(set(class1).intersection(class2))

[201009157,
 201002245,
 201009671,
 201008775,
 201102471,
 201108238,
 201105295,
 201108241,
 201105430,
 201106199,
 201003675,
 201009820,
 201103263,
 201102367,
 201004454,
 201002279,
 201009959,
 201105318,
 201109930,
 201003688,
 201101996,
 201005482,
 201102510,
 201009967,
 201103024,
 201109680,
 201008815,
 201109299,
 201106739,
 201007925,
 201005367,
 201105592,
 201008697,
 201002173,
 201102397,
 201104063,
 201109056,
 201004865,
 201109823,
 201007043,
 201105857,
 201101893,
 201009096,
 201009997,
 201108816,
 201104594,
 201003730,
 201006042,
 201005275,
 201106780,
 201005150,
 201002849,
 201007074,
 201005415,
 201108071,
 201105896,
 201105259,
 201102318,
 201102320,
 201105014,
 201005821,
 201005822]

Task 4

In [ ]:
def get_grades_opt(grades):
  pgrades = [df.prelim_grades] 
  mgrades = [df.midterm_grades] 
  fgrades = [df.final_grades] 
  sgrades = [df.pgrades * 0.3 + df.mgrades * 0.3 + df.fgrades * 0.4]
  return sgrades

  print(sgrades) 
  print(semestral(df.semestral_grades))

In [ ]:
print(sgrades)

[0     93.95368
1     94.17768
2     85.48800
3     81.71960
4     93.95368
5     86.62518
6     95.64512
7     72.18334
8     86.55088
9     87.18088
10    86.93518
11    85.48800
12    86.55088
13    85.48800
14    86.30518
15    59.85238
16    95.64512
17    81.50368
18    80.24088
19    67.23410
20    95.64512
21    81.50368
22    86.30518
23    93.95368
24    82.69168
25    95.32512
26    84.98988
Name: semestral_grades, dtype: float64]

In [ ]:
def get_failed(grades):

  for grade in grades:
 
    fgrades = df[df["semestral_grades"] < 70]
    return fgrades

In [ ]:
print(get_failed(df))

     name  id  prelim_grades  midterm_grades  final_grades  semestral_grades
15  koppa  16          0.000          87.685       83.8672          59.85238
19   neta  20         69.314          87.685       50.3360          67.23410

In [ ]:
def fail_count(grades):
  for grade in grades:
      rows = df.shape[0]
      failgrade = ('Number of failed students:' +  str(rows))
      
      return failgrade 

print (fail_count(df))

Number of failed students:2